**** time execution record
| ./bin/memory_access_without_parallel 100000 1 (remote case) | ./bin/memory_access_without_parallel 100000 0 (local) |
|                                                162444187364 |                                          138574271370 |
|                                                155324195985 |                                          149659914995 |
|                                                159565283709 |                                          148881298203 |
|                                               159111220000. |                                         145705160000. |
#+TBLFM: @5$1=vmean(@2..@4)::@5$2=vmean(@2..@4)


| ./bin/memory_access_without_parallel 10000 1 (remote) | ./bin/memory_access_without_parallel 10000 0 (local) |
|                                            1403278413 |                                           1262754231 |
|                                            1635843573 |                                           1428285921 |
|                                            1661301586 |                                           1483400262 |
|                                            1530844828 |                                           1355476917 |
|                                            1557817100 |                                          1382479300. |
#+TBLFM: @6$1=vmean(@2..@5)::@6$2=vmean(@2..@5)
**** time mesurement 
#+BEGIN_SRC sh
  cat numa_openmp.sh
  export OMP_PLACES="{0, 4, 8, 12, 16, 20, 24, 28}, {32, 36, 40, 44, 48, 52, 56, 60}, {2, 6, 10, 14, 18, 22, 26, 30}, {34, 38, 42, 46, 50, 54, 58, 62}, {3, 7, 11, 15, 19, 23, 27, 31}, {35, 39, 43, 47, 51, 55, 59, 63}, {1, 5, 9, 13, 17, 21, 25, 29}, {33, 37, 41, 45, 49, 53, 57, 61}"
  ./bin/numa_openmp 16000 16000 8
  ./bin/anti_numa_openmp 16000 16000 8
  ./bin/openmp_without_numa 16000 16000 8
#+END_SRC
|   id | use libnuma(ms) | not use libnuma(ms) | use libnuma on remote node |
|    1 |            3880 |                 420 |                       3934 |
|    2 |            4034 |                 416 |                       3973 |
|    3 |            4020 |                 418 |                       3960 |
|    4 |            3975 |                 419 |                       3951 |
|    5 |            4033 |                 413 |                       3908 |
| mean |          3988.4 |               417.2 |                     3945.2 |
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)
- It seems this approach make the libnuma case becomes worse.
- The execution time of using libnuma and the execution time of using libnuma but allocated memory deliberately on remote node is also similar. This indicate I have lot of remote memory access cases.
- This whole program is wrong because each row of the matrix need to multiple very element of vector, there is no point of allocation vector across multiple nodes.

